# Домашнее задание к занятию 11.2 "Кеширование Redis/memcached"

### Задание 1. Кэширование. 

Приведите примеры проблем, которые может решить кэширование. 

*Приведите ответ в свободной форме.*

### Ответ: 

В условиях современных тенденций оптимизаций систем и использование мощностей машин с максимальным КПД, масштабируемость и избыточность решаеться разными способами. Кеширование как инструмент оптимизации идеально подходит для решения этих задач. Снижение нагрузки на систему, уменьшение времени отклика, общая оптимизация систем и кластеров, стабильная работа при снижении мощностей, снижение нагрузки на систему в пиковые часы работы, ускорение работы - вот те, если говорить обобщенными понятиями, проблемы которые решает кеширование.  

---

### Задание 2. Memcached.

Установите и запустите memcached.

*Приведите скриншот systemctl status memcached, где будет видно, что memcached запущен.*

### Ответ:

![Image alt](https://github.com/IvanSKorobkov/homework/blob/main/%D0%A1%D0%BD%D0%B8%D0%BC%D0%BE%D0%BA%20%D1%8D%D0%BA%D1%80%D0%B0%D0%BD%D0%B0%20%D0%BE%D1%82%202022-11-07%2023-04-10.png)



---

### Задание 3. Удаление по TTL в Memcached.

Запишите в memcached несколько ключей с любыми именами и значениями, для которых выставлен TTL 5. 

*Приведите скриншот, на котором видно, что спустя 5 секунд ключи удалились из базы.*

### Ответ: 

![Image alt](https://github.com/IvanSKorobkov/homework/blob/main/%D0%A1%D0%BD%D0%B8%D0%BC%D0%BE%D0%BA%20%D1%8D%D0%BA%D1%80%D0%B0%D0%BD%D0%B0%20%D0%BE%D1%82%202022-11-07%2023-03-30.png)

---

### Задание 4. Запись данных в Redis. 

Запишите в redis несколько ключей с любыми именами и значениями. 

*Через redis-cli достаньте все записанные ключи и значения из базы, приведите скриншот этой операции.*


## Дополнительные задания (со звездочкой*)
Эти задания дополнительные (не обязательные к выполнению) и никак не повлияют на получение вами зачета по этому домашнему заданию. Вы можете их выполнить, если хотите глубже и/или шире разобраться в материале.

### Задание 5*. Работа с числами. 

Запишите в redis ключ key5 со значением типа "int" равным числу 5. Увеличьте его на 5, чтобы в итоге в значении лежало число 10.  

*Приведите скриншот, где будут проделаны все операции и будет видно, что значение key5 стало равно 10.*
